:PROPERTIES:
:ID:       8667b78f-2dc6-44f2-a893-a3718a247bb2
:END:
#+title: CPP
filetags: CPP

* C++ Basics
** Objects and Variables
:PROPERTIES:
:ID: Objects and Variables
:collapsed: true
:END:

In C++ direct memory access is discouraged. So we use objects for that.
Instead of telling go get the value stored in mailbox number 7532, we tell go get the value stored by this object.
So that the compiler can figure it out how to retrive the value

Variable

Memory is allocated during the run time.

#+begin_src cpp
#include <iostream>

int main() {

    int x;

    return 0;
}
#+end_src

*** Variable assigment
#+begin_src cpp
#include <iosteam>
using namespace std;
int main() {
    int x {5};
    cout << x;
    return 0;
}
#+end_src

#+RESULTS:
: 5

#+begin_src cpp
int a;         // default-initialization (no initializer)

// Traditional initialization forms:
int b = 5;     // copy-initialization (initial value after equals sign)
int c ( 6 );   // direct-initialization (initial value in parenthesis)

// Modern initialization forms (preferred):
int d { 7 };   // direct-list-initialization (initial value in braces)
int e {};      // value-initialization (empty braces)
#+end_src
*** maybe unused

#+begin_src cpp
#include <iostream>

int main()
{
    [[maybe_unused]] double pi { 3.14159 };  // Don't complain if pi is unused
    [[maybe_unused]] double gravity { 9.8 }; // Don't complain if gravity is unused
    [[maybe_unused]] double phi { 1.61803 }; // Don't complain if phi is unused

    std::cout << pi << '\n';
    std::cout << phi << '\n';

    // The compiler will no longer warn about gravity not being used

    return 0;
}
#+end_src
*** cout and cin
#+begin_src cpp
#include <iostream>
using namespace std;
int main() {
    int x{},y{};
    cin >> x >> y;
    cout << x << " " <<  y << '\n';
    return 0;
}
#+end_src

#+begin_src cpp
#include <iostream>
using namespace std;
int main() {
    int x{};
    cin >> x;

    int y{};
    cin >> y;

    cout << x << " " << y << "\n";
    return 0;
}

#+end_src

#+begin_src cpp
#include <iostream>  // for std::cout and std::cin

int main()
{
    std::cout << "Enter a number: "; // ask user for a number
    int x{}; // define variable x to hold user input
    std::cin >> x; // get number from keyboard and store it in variable x
    std::cout << "You entered " << x << '\n';

    return 0;
}
#+end_src
*** Uninitialized variables and undefined behavioure

Returns garbage value ----> Memory address

#+begin_src cpp
#include <iostream>

int main() {
    int x;
    std::cout << x << '\n';
    return 0;
}

#+end_src

#+RESULTS:
: 32765
*** Keywords and Identifiers

List of 92 keywords

| Keyword   | Keyword      | Keyword          | Keyword       |
|-----------+--------------+------------------+---------------|
| alignas   | const_cast   | int              | static_assert |
| alignof   | continue     | long             | static_cast   |
| and       | co_await     | mutable          | struct        |
| and_eq    | co_return    | namespace        | switch        |
| asm       | co_yield     | new              | template      |
| auto      | decltype     | noexcept         | this          |
| bitand    | default      | not              | thread_local  |
| bitor     | delete       | not_eq           | throw         |
| bool      | do           | nullptr          | true          |
| break     | double       | operator         | try           |
| case      | dynamic_cast | or               | typedef       |
| catch     | else         | or_eq            | typeid        |
| char      | enum         | private          | typename      |
| char8_t   | explicit     | protected        | union         |
| char16_t  | export       | public           | unsigned      |
| char32_t  | extern       | register         | using         |
| class     | false        | reinterpret_cast | virtual       |
| compl     | float        | requires         | void          |
| concept   | for          | return           | volatile      |
| const     | friend       | short            | wchar_t       |
| consteval | goto         | signed           | while         |
| constexpr | if           | sizeof           | xor           |
| constinit | fnline       | static           | xor_eq        |
** Functions and Files
:PROPERTIES:
:ID: Functions and Files
:END:


#+begin_src cpp
#include <iostream>

int returnvalue()
{
    int a;
    std::cin >> a;
    return a;
}

int main()
{
    int num { returnvalue() };

    std::cout << num << '\n';

    return 0;
}
#+end_src
*** Void functions
#+begin_src cpp
#include <iostream>

void printHi()
{
    std::cout << "Hi" << '\n';
}

int main() {

    //printHi();
    std::cout << printHi() << '\n';
    printf()
        printf()printf(jsbcb)print()
    return 0;printf
}
#+end_src


#+begin_src cpp
#include <iostream>

int main() {

    unsigned short a{0};
    std::cout << a << '\n';

    a = -4;
    std::cout << a << '\n';

    return 0;
}
#+end_src

#+RESULTS:
** size_t[[https://www.learncpp.com/cpp-tutorial/fixed-width-integers-and-size-t/][ link to topic]]

#+begin_src cpp
#include <iostream>

int main(){
    bool a = 0;
    bool b = 30;

    std::cout << a << '\n';
    std::cout << b << '\n';
    return 0;
}
#+end_src
** Char(ASCII TABLE LINK) [[https://www.learncpp.com/cpp-tutorial/chars/][here]]

#+begin_src cpp
#include <iostream>

int main() {
    char grade{65};
    std::cout << grade << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: A

#+begin_src cpp
#include <iostream> //

int main() {

    char grade {};

    std::cin >> grade;

    std::cout << grade << '\n';

    return 0;
}
#+end_src

** Implicit and Explicit Coversion
:PROPERTIES:
:ID: Implicit and Explicit Coversion
:END:

Implicit conversion are made by compilers whereas explicit are made manually

Syntax for Exclipit conversion ----> static_cast<new_type>(expression)

#+begin_src cpp :results output
#include <iostream>

int main() {

    double a{65.5};

    std::cout << a << '\n';

    std::cout << static_cast<int>(a) << '\n';

    std::cout << static_cast<char>(a) << '\n';

    std::cout << static_cast<float>(a) << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: 65.5
: 65
: A
: 65.5

*** Sign conversion using static_cast
:PROPERTIES:
:ID:       Sign converstions using static_cast
:END:

#+begin_src cpp :results output
#include <iostream>

int main() {

    int x{-1};

    unsigned int y {static_cast<unsigned int>(x)};

    std::cout << y << '\n';

    unsigned int u {4294967295}; //here 4294967295 is largest 32bit unsigned int

    std::cout << static_cast<signed int>(u);

    return 0;
}
#+end_src

#+RESULTS:
: 4294967295
: -1

#+begin_src cpp
#include <iostream>

int main() {
    char a {};

    std::cin >> a;

    int b = a;

    std::cout << "You entered " << a << "," << "which has ACCII code " << b << '\n'; // OR use static_cast<int>(a) instead of another variable

    return 0;
}
#+end_src

#+RESULTS:

*** Quiz [[https://www.learncpp.com/cpp-tutorial/chapter-4-summary-and-quiz/][Questions]]

 Q2.
 #+begin_src cpp
#include <iostream>

int main() {
    double x,y;
    char c;
    std::cin >> x >> y;
    std::cout << "Enter +, -, *, /: " << '\n';
    std::cin >> c;

    if(c == '+') {
        std::cout << x+y << '\n';
    }else if (c == '-'){
        std::cout << x-y << '\n';

    }else if (c == '*'){
        std::cout << x*y << '\n';
    }else if (c == '/'){
        std::cout << x/y << '\n';
    }else {
        std::cout << "" << '\n';
    }


    return 0;
}
 #+end_src

Q3.
#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    double height{};
    cout << "Enter the height of the tower in meters: ";
    cin >> height;

    double new_height{height};

    for(int i=0;new_height > 0;i++) {
        double distance_fallen = 9.8 * (i*i) /2.0;

       new_height = height - distance_fallen;

       if(new_height < 0) {
           cout << "At " << i << " seconds, " << "the ball is on the ground" << '\n';
           break;
       }
       cout << "At " << i << " seconds, " << "the ball is at height: " << new_height << " meters" << '\n';


    }

    return 0;
}
#+end_src

* Fundamental Data Types
** Numeral Systems (decimal, binary, hexadecimal)
:PROPERTIES:
:ID:       Numeral Systems (Decimal, hexadecimal..)
:END:

*** Octal

In octal there are no 8 and 9.
So 8 is represented as 10 and
9 - 11
10 - 12
15 - 17
16 - 20
17 - 21 and so on

For representing it as octal number we use "0" infront of the number

#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    int x{017};
    cout << x << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: 15

*** hexadecimal

Hexadecimal base is 16 and we count like  0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F, 10, 11, 12, …
To use hexadecimal we use prefix "0x"
#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    int x{0xF};
    int y{0x1A}; //here 1A in hexadecimal means 26 in decimal
    cout << x << '\n';
    cout << y << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: 15
: 26

*** Binary

Binary has base 2.
We use prefix 0b for binary numbers
#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    int x{0101}; //octal
    int y{0x101}; //hexadecimal
    int z{0b101}; //binary

    cout << x << '\n';
    cout << y << '\n';
    cout << z << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: 65
: 257
: 5

*** Outputting values in decimal, octal and hexadecimal

#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    int x{44};

    cout << hex << x << '\n';
    cout << oct << x << '\n';
    cout << dec << x << '\n';
    cout <<  x << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: 2c
: 54
: 44
: 44

*** Outputting values in Binary using std::bitset

#+begin_src cpp :results output
#include <iostream>
#include <bitset>

using namespace std;

int main() {
    bitset<4> x {5};
    bitset<8> y {20};
    bitset<8> z {0xF}; //decimal 15

    cout << x << '\n';
    cout << y << '\n';
    cout << z << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: 0101
: 00010100
: 00001111

* Strings
** Strings (std::string)
:PROPERTIES:
:ID:       Strings (std::string)
:END:

The header <string> helps to input and output stings of different size

#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    string name {"Shiva"};
    cout << name << '\n';

    name = "Prasad37";
    cout << name << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: Shiva
: Prasad37
** Strings (std::string_view)
:PROPERTIES:
:ID: Strings (std::string_view)
:END:
- string_view is used for reading a string in a more cleaner way.
- Instead of creating a copy of string again where required like std::string.
- It just points to the original data.

- For modifies and chaning the original string value ---- std::string
- For viewing the data in the string ---- std::string_view

For using string_view we have to use <string_view> header file

#+begin_src cpp :results output
#include <iostream>
#include <string>
#include <string_view>
using namespace std;

void string_View(string_view x) {  // here no copy is made it just points to original data
    cout << x << '\n';

    //string z {"Kyaram"};    Doesnt work here
    //x += z;
    //cout << x << '\n';
}

void String(string y) {  //here it creates the copy so we can modify the contents here
    cout << y << '\n';

    string z {"Kyaram"};
    y += z;
    cout << y << '\n';
}

int main() {
    string name {"Shivaprasad"};

    string_View(name);

    String(name);

    return 0;
}
#+end_src

Example

#+begin_src cpp :results output
#include <iostream>
#include <string>
#include <string_view>
using namespace std;

int main() {

    string name {"Shiva"};
    string_view name1 {name};

    cout << name1 << '\n';

    name1 = "Kyaram";
    cout << name1 << '\n';

    cout << name << '\n';

    return 0;
}
#+end_src

* Operators
:PROPERTIES:
:ID: Operators
:END:
[[https://www.learncpp.com/cpp-tutorial/operator-precedence-and-associativity/][Operator Precedence table]]

Exponent

#+begin_src cpp :results output
#include <iostream>
#include <cmath>

int main() {
    int x{2};
    std::cout << std::pow(x,2) << '\n';
    return 0;
}
#+end_src
* Bit Manipulation
** Uses of <bitset> library
:PROPERTIES:
:ID: <Uses of <bitset> library>
:END:
It has
1. test()
2. set()
3. reset()
4. flip()

#+begin_src cpp :results output
#include <iostream>
#include <bitset>
using namespace std;

int main() {
    bitset<8> bits{0b0000'0101};

    cout << bits << '\n';
    cout << bits.test(2) << '\n';
    bits.set(1);
    cout << bits << '\n';
    bits.reset(0);
    cout << bits << '\n';
    bits.flip(0);
    cout << bits << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: 00000101
: 1
: 00000111
: 00000110
: 00000111

[[https://www.learncpp.com/cpp-tutorial/bitwise-operators/][Quiz]]

#+begin_src cpp :results output
#include <bitset>
#include <iostream>

// "rotl" stands for "rotate left"
std::bitset<4> rotl(std::bitset<4> bits)
{
    if(bits.test(3) == 0) {
        bits <<= 1;
    }else {
       bits <<= 1;
       bits.set(0);
    }

    return bits;
}

int main()
{
    std::bitset<4> bits1{ 0b0001 };
    std::cout << rotl(bits1) << '\n';

    std::bitset<4> bits2{ 0b0101 };
    std::cout << rotl(bits2) << '\n';

    return 0;
}
#+end_src

#+RESULTS:
: 0010
: 1010

#+begin_src cpp :results output
#include <bitset>
#include <iostream>

std::bitset<4> rotl(std::bitset<4> bits)
{
    return (bits<<1) | (bits>>3);
}

int main()
{
    std::bitset<4> bits1{ 0b0001 };
    std::cout << rotl(bits1) << '\n';

    std::bitset<4> bits2{ 0b1001 };
    std::cout << rotl(bits2) << '\n';

    return 0;
}
#+end_src

** Bitmanipulation by bit masks
:PROPERTIES:
:ID: Bitmanipulation by bit masks
:END:

Bit masks --- These are predefined set of bits used to select which specific will be modified

#+begin_src cpp :results output
#include <cstdint>

constexpr std::uint8_t mask0{ 0b0000'0001 }; // represents bit 0
constexpr std::uint8_t mask1{ 0b0000'0010 }; // represents bit 1
constexpr std::uint8_t mask2{ 0b0000'0100 }; // represents bit 2
constexpr std::uint8_t mask3{ 0b0000'1000 }; // represents bit 3
constexpr std::uint8_t mask4{ 0b0001'0000 }; // represents bit 4
constexpr std::uint8_t mask5{ 0b0010'0000 }; // represents bit 5
constexpr std::uint8_t mask6{ 0b0100'0000 }; // represents bit 6
constexpr std::uint8_t mask7{ 0b1000'0000 }; // represents bit 7
#+end_src


1. Checking if a bit is on or off by using bit masks - We use AND(&) operator.
2. To set a bit - we use OR equals(|=) operator
3. To reset a bit - We use bitwise AND and bitwise NOT operator (&= ~)
4. To flip a bit - we use bitwise XOR (^=) operator

#+begin_src cpp :results output
#include <iostream>
#include <cstdint>

int main() {
    constexpr std::uint8_t mask0{ 0b0000'0001 }; // represents bit 0
    constexpr std::uint8_t mask1{ 0b0000'0010 }; // represents bit 1
    constexpr std::uint8_t mask2{ 0b0000'0100 }; // represents bit 2
    constexpr std::uint8_t mask3{ 0b0000'1000 }; // represents bit 3
    constexpr std::uint8_t mask4{ 0b0001'0000 }; // represents bit 4
    constexpr std::uint8_t mask5{ 0b0010'0000 }; // represents bit 5
    constexpr std::uint8_t mask6{ 0b0100'0000 }; // represents bit 6
    constexpr std::uint8_t mask7{ 0b1000'0000 }; // represents bit 7

    std::uint8_t flags {0b0000'0101}; // It means bit 0 and 2 are ON.

    std::cout << (static_cast<bool>(flags & mask0)? "ON\n" : "OFF\n");  // TO CHECK ON AND OFF

    std::cout << (static_cast<bool>(flags & mask1)? "ON\n" : "OFF\n");

    flags |= mask1; // TO SET THE BIT
    flags |= (mask3 | mask4 | mask5); // TO SET MULTIPLE BITS
    std::cout << (static_cast<bool>(flags & mask1)? "ON\n" : "OFF\n");

    flags &= ~mask1; //TO RESET THE BIT
    std::cout << (static_cast<bool>(flags & mask1)? "ON\n" : "OFF\n");

    flags ^= mask1; //TO FLIP THE BIT
    std::cout << (static_cast<bool>(flags & mask1)? "ON\n" : "OFF\n");

    return 0;
}

#+end_src

#+RESULTS:
: ON
: OFF
: ON
: OFF
: ON

[[https://www.learncpp.com/cpp-tutorial/bit-manipulation-with-bitwise-operators-and-bit-masks/][Quiz]]

#+begin_src cpp :results output
#include <bitset>
#include <cstdint>
#include <iostream>

int main()
{
    [[maybe_unused]] constexpr std::uint8_t option_viewed{ 0x01 };
    [[maybe_unused]] constexpr std::uint8_t option_edited{ 0x02 };
    [[maybe_unused]] constexpr std::uint8_t option_favorited{ 0x04 };
    [[maybe_unused]] constexpr std::uint8_t option_shared{ 0x08 };
    [[maybe_unused]] constexpr std::uint8_t option_deleted{ 0x10 };

    std::uint8_t myArticleFlags{ option_favorited };
    std::cout << std::bitset<8>{ myArticleFlags } << '\n';

    myArticleFlags |= option_viewed;
    std::cout << (static_cast<bool>(option_favorited & option_deleted)? "NOT DELETED\n" : "DELETED\n");

    myArticleFlags &= ~option_favorited;
    std::cout << std::bitset<8>{ myArticleFlags } << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: 00000100
: DELETED
: 00000001

Q1. Write a program that asks the user to input a number between 0 and 255. Print this number as an 8-bit binary number (of the form #### ####). Don’t use any bitwise operators. Don’t use std::bitset

#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    int decimal_num{};

    cout << "Enter a number between 0 and 255\n";
    cin >> decimal_num;

    for(int divisor{128}; divisor >= 1; divisor /= 2) {
        if((decimal_num/divisor)%2 == 0) {
            cout << '0';
        }else {
            cout << '1';
        }
    }

    return 0;
}
#+end_src
* Namespace and scope resolution

#+begin_src cpp :results output
#include <iostream>
using namespace std;

namespace Foo
{
    int dosomething(int a, int b) {
        return a+b;
    }
}
namespace Goo
{
    int dosomething(int a, int b) {
        return a-b;
    }
}

int main()
{
    cout << Goo::dosomething(1,2) << '\n';  // "::" ------> called scope resolution operator
    cout << Foo::dosomething(1,2) << '\n';
    return 0;
}
#+end_src

#+RESULTS:
: -1
: 3

** Static local variables
:PROPERTIES:
:ID: Static local variables
:END:

local varibales --- created at the start of block and destroyed at the end of block
static local varibales ----- created at the start of program and destroyed at the end of program.

example without static
#+begin_src cpp :results output
#include <iostream>
using namespace std;

void increment()
{
    int x{1};
    ++x;
    cout << x << "\n";
}

int main() {
    increment();
    increment();
    increment();
    return 0;
}
#+end_src

#+RESULTS:
: 2
: 2
: 2

example with static
#+begin_src cpp :results output
#include <iostream>
using namespace std;

void increment()
{
    static int x{1};
    x++;
    cout << x << "\n";
}
int main() {
   increment();
   increment();
   increment();
    return 0;
}
#+end_src

#+RESULTS:
: 2
: 3
: 4
* Control Flow
** Switch case
:PROPERTIES:
:ID: Switch case
:END:

#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {

    int x{3};

    switch(x)
    {
    case 1:
        cout << "One" << "\n";
        break;
    case 2:
        cout << "Two" << "\n";
        break;
    default:
        cout << "Error" << "\n";
        break;
    }

    return 0;
}
#+end_src

#+RESULTS:
: Error
** goto statements
#+begin_src cpp :results output
#include <iostream>
using namespace std;

    void printhello(bool is)
    {
        if(is)
        {
            goto end;
        }
        cout << "Hello" << "\n";
end:
     cout << "end" << "\n";
    }

int main() {
    printhello(true);
    //printhello(false);
    return 0;
}
#+end_src

#+RESULTS:
: end
** While loop
#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    char alp{65};

   while(alp <= 90)
   {
       cout << alp << "-" << static_cast<int>(alp) << "\n";
       alp++;
   }

    return 0;
}
#+end_src

#+begin_src cpp :results output
#include <iostream>
using namespace std;

int main() {
    int x{5};

    while(x > 0)
    {
        int i = x;
        while(i > 0)
        {
            cout << i << " ";
            i--;
        }
        cout << "\n";
        x--;
    }

    return 0;
}
#+end_src

#+RESULTS:
: 5 4 3 2 1
: 4 3 2 1
: 3 2 1
: 2 1
: 1

